#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

google_project_service.artifactregistry: Refreshing state... [id=liatrioexercise/artifactregistry.googleapis.com]
google_project_service.container: Refreshing state... [id=liatrioexercise/container.googleapis.com]
google_service_account.sa: Refreshing state... [id=projects/liatrioexercise/serviceAccounts/githubactionssvc@liatrioexercise.iam.gserviceaccount.com]
google_iam_workload_identity_pool.githubpool: Refreshing state... [id=projects/liatrioexercise/locations/global/workloadIdentityPools/ghauth-pool]
google_project_service.service_usage: Refreshing state... [id=liatrioexercise/serviceusage.googleapis.com]
google_project_service.crm: Refreshing state... [id=liatrioexercise/cloudresourcemanager.googleapis.com]
google_artifact_registry_repository.artifactrepo: Refreshing state... [id=projects/liatrioexercise/locations/us-west2/repositories/liatrioexercise-repo]
google_project_service.compute: Refreshing state... [id=liatrioexercise/compute.googleapis.com]
google_storage_bucket.my_bucket: Refreshing state... [id=bucket-bboles-01]
google_compute_network.vpc: Refreshing state... [id=projects/liatrioexercise/global/networks/liatrioexercise-vpc]
google_project_iam_binding.sabind: Refreshing state... [id=liatrioexercise/roles/editor]
google_service_account_iam_member.workload_identity_user: Refreshing state... [id=projects/liatrioexercise/serviceAccounts/githubactionssvc@liatrioexercise.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/830061839325/locations/global/workloadIdentityPools/ghauth-pool/attribute.repository/bboles/liatrioexercise]
google_iam_workload_identity_pool_provider.github: Refreshing state... [id=projects/830061839325/locations/global/workloadIdentityPools/ghauth-pool/providers/ghauth-provider]
google_compute_subnetwork.subnet: Refreshing state... [id=projects/liatrioexercise/regions/us-west2/subnetworks/liatrioexercise-subnet]
google_container_cluster.primary: Refreshing state... [id=projects/liatrioexercise/locations/us-west2/clusters/liatrioexercise-gke]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # google_storage_bucket.my_bucket must be replaced
-/+ resource "google_storage_bucket" "my_bucket" {
      - default_event_based_hold    = false -> null
      ~ id                          = "bucket-bboles-01" -> (known after apply)
      - labels                      = {} -> null
      ~ name                        = "bucket-bboles-01" -> "bucket-bboles-02" # forces replacement
      ~ project                     = "liatrioexercise" -> (known after apply)
      ~ public_access_prevention    = "inherited" -> (known after apply)
      - requester_pays              = false -> null
      ~ self_link                   = "https://www.googleapis.com/storage/v1/b/bucket-bboles-01" -> (known after apply)
      ~ uniform_bucket_level_access = false -> (known after apply)
      ~ url                         = "gs://bucket-bboles-01" -> (known after apply)
        # (3 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @bboles, Action: `pull_request`*